kAMDSuccess = "Es ist kein Fehler aufgetreten.";
kAMDUndefinedError = "Es ist ein unbekannter Fehler aufgetreten.";
kAMDBadHeaderError = "Die Datei kann nicht übertragen werden.";
kAMDNoResourcesError = "Keine Ressource verfügbar.";
kAMDReadError = "Vom Gerät konnte nicht gelesen werden.";
kAMDWriteError = "Auf das Gerät konnte nicht geschrieben werden.";
kAMDUnknownPacketError = "Das Paket ist unbekannt.";
kAMDInvalidArgumentError = "Das Argument ist ungültig.";
kAMDNotFoundError = "Die Datei konnte nicht gefunden werden.";
kAMDIsDirectoryError = "Der Pfad ist ein Verzeichnis.";
kAMDPermissionError = "Sie haben nicht die benötigten Zugriffsrechte.";
kAMDNotConnectedError = "Keine Verbindung zum Gerät.";
kAMDTimeOutError = "Der Vorgang hat das Zeitlimit überschritten.";
kAMDOverrunError = "Es ist eine Pufferüberschreitung aufgetreten.";
kAMDEOFError = "Dateiende.";
kAMDUnsupportedError = "Der Vorgang wird nicht unterstützt.";
kAMDFileExistsError = "Die Datei existiert bereits.";
kAMDBusyError = "Das Gerät ist in Betrieb.";
kAMDCryptoError = "Es konnte keine sichere Verbindung zum Gerät hergestellt werden.";
kAMDTooBigError = "Das Nachricht ist zu groß.";
kAMDInvalidResponseError = "Unerwartete Antwort vom Gerät erhalten.";
kAMDMissingKeyError = "Der Schlüssel fehlt.";
kAMDMissingValueError = "Der Wert fehlt.";
kAMDGetProhibitedError = "Ein Wert kann nicht vom kennwortgeschützten Gerät abgerufen werden.";
kAMDSetProhibitedError = "Ein Wert auf dem Gerät kann nicht festgelegt werden.";
kAMDRemoveProhibitedError = "Ein Wert auf dem Gerät kann nicht entfernt werden.";
kAMDImmutableValueError = "Dieser Wert kann nicht geändert werden.";
kAMDPasswordProtectedError = "Das Gerät ist kennwortgeschützt.";
kAMDMissingHostIDError = "Das Gerät hat diesen Host nicht erkannt.";
kAMDInvalidHostIDError = "Das Gerät hat diesen Host nicht erkannt.";
kAMDSessionActiveError = "Die Session ist aktiv.";
kAMDSessionInactiveError = "Die Session ist inaktiv.";
kAMDMissingSessionIDError = "Die Session-ID fehlt.";
kAMDInvalidSessionIDError = "Die Session-ID ist ungültig.";
kAMDMissingServiceError = "Der Dienst fehlt.";
kAMDInvalidServiceError = "Der Dienst ist ungültig.";
kAMDServiceLimitError = "Es wurden bereits zu viele Instanzen dieses Dienstes aktiviert.";
kAMDCheckinSetupFailedError = "Der Dienst konnte auf dem Gerät nicht gestartet werden";
kAMDInvalidCheckinError = "Der Dienst konnte auf dem Gerät nicht gestartet werden";
kAMDCheckinTimeoutError = "Der Dienst konnte nicht ordnungsgemäß auf dem Gerät gestartet werden.";
kAMDCheckinConnectionFailedError = "Der Dienst konnte nicht ordnungsgemäß auf dem Gerät gestartet werden.";
kAMDCheckinReceiveFailedError = "Der Dienst konnte nicht ordnungsgemäß auf dem Gerät gestartet werden.";
kAMDCheckinResponseFailedError = "Der Dienst konnte nicht ordnungsgemäß auf dem Gerät gestartet werden.";
kAMDCheckinOutOfMemoryError = "Der Dienst konnte nicht ordnungsgemäß auf dem Gerät gestartet werden.";
kAMDCheckinSendFailedError = "Der Dienst konnte nicht ordnungsgemäß auf dem Gerät gestartet werden.";
kAMDMissingPairRecordError = "Der Host ist nicht mit dem Gerät gekoppelt.";
kAMDInvalidPairRecordError = "Der Host ist nicht mehr mit dem Gerät gekoppelt.";
kAMDSavePairRecordFailedError = "Das Kopplungsprotokoll konnte nicht gesichert werden.";
kAMDInvalidActivationRecordError = "Der Aktivierungseintrag ist ungültig.";
kAMDMissingActivationRecordError = "Der Aktivierungseintrag wurde nicht gefunden.";
kAMDServiceProhibitedError = "Der Dienst konnte auf dem Gerät nicht gestartet werden.";
kAMDEscrowLockedError = "Das Gerät ist erst nach dem ersten Entsperren verfügbar.";
kAMDProhibitedBySupervision = "Der Vorgang ist auf betreuten Geräten nicht erlaubt.";
kAMDPairingProhibitedError = "Verbindung nur über USB möglich";
kAMDWrongDroidError = "Das Gerät ist im Wartungszustand.";
kAMDSUVerificationError = "Das Software-Update-Paket konnte nicht überprüft werden.";
kAMDSUPatchError = "Die Datei kann nicht repariert werden.";
kAMDSUFirmwareError = "Die Firmware kann nicht aktualisiert werden.";
kAMDProvisioningProfileNotValid = "Das Bereitstellungsprofil ist nicht gültig.";
kAMDSendMessageError = "Eine Nachricht konnte nicht an das Gerät gesendet werden.";
kAMDReceiveMessageError = "Eine Nachricht vom Gerät konnte nicht empfangen werden.";
kAMDMissingOptionsError = "Die Optionen fehlen.";
kAMDMissingImageTypeError = "Das Bild fehlt.";
kAMDDigestFailedError = "Das Festplatten-Image konnte nicht gelesen werden.";
kAMDStartServiceError = "Der Dienst konnte nicht gestartet werden.";
kAMDInvalidDiskImageError = "Das Image ist ungültig.";
kAMDMissingDigestError = "Die Verarbeitung fehlt.";
kAMDMuxError = "Es ist ein Fehler mit dem Multiplexer des USB-Geräts aufgetreten.";
kAMDApplicationAlreadyInstalledError = "Eine System-App mit der angegebenen Bundle-ID ist bereits auf dem Gerät installiert und kann nicht ersetzt werden.";
kAMDApplicationMoveFailedError = "Die App kann nicht an den Ort auf dem Gerät bewegt werden.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Die App kann nicht in der Sandbox ausgeführt werden.";
kAMDApplicationVerificationFailedError = "Die App konnte nicht überprüft werden.";
kAMDArchiveDestructionFailedError = "Der App-Container konnte nicht archiviert werden.";
kAMDBundleVerificationFailedError = "Das Netzbetreiber-Bundle konnte nicht überprüft werden.";
kAMDCarrierBundleCopyFailedError = "Das Netzbetreiber-Bundle konnte nicht installiert werden.";
kAMDCarrierBundleDirectoryCreationFailedError = "Das Netzbetreiber-Bundle-Verzeichnis konnte nicht erstellt werden.";
kAMDCarrierBundleMissingSupportedSIMsError = "Für dieses Netzbetreiber-Bundle werden keine SIMs unterstützt.";
kAMDCommCenterNotificationFailedError = "Es wurden keine Mitteilungen vom Basisband erkannt.";
kAMDContainerCreationFailedError = "Der App-Container konnte nicht erstellt werden.";
kAMDContainerP0wnFailedError = "Die Zugriffsrechte auf den App-Container konnten nicht repariert werden.";
kAMDContainerRemovalFailedError = "Der App-Container konnte nicht entfernt werden.";
kAMDEmbeddedProfileInstallFailedError = "Das eingebettete Bereitstellungsprofil konnte nicht installiert werden.";
kAMDErrorError = "Ein Fehler ist aufgetreten.";
kAMDExecutableTwiddleFailedError = "Die ausführbaren Zugriffsrechte der App konnten nicht geändert werden.";
kAMDExistenceCheckFailedError = "Es konnte nicht überprüft werden, ob die App bereits vorhanden ist.";
kAMDInstallMapUpdateFailedError = "Die Liste der installierten Apps konnte nicht aktualisiert werden.";
kAMDManifestCaptureFailedError = "Das App-Manifest konnte nicht gesichert werden.";
kAMDMapGenerationFailedError = "Die Liste der Apps konnte nicht erstellt werden.";
kAMDMissingBundleExecutableError = "Das App-Bundle enthält keine ausführbare Datei.";
kAMDMissingBundleIdentifierError = "Das App-Bundle enthält keine gültige Kennung.";
kAMDMissingBundlePathError = "Der App-Bundle-Pfad konnte nicht ermittelt werden.";
kAMDMissingContainerError = "Der Container für die installierte App wurde nicht gefunden.";
kAMDNotificationFailedError = "Es konnte keine Mitteilungen veröffentlicht werden.";
kAMDPackageExtractionFailedError = "Das App-Paket konnte nicht geöffnet werden.";
kAMDPackageInspectionFailedError = "Das App-Paket konnte nicht überprüft werden.";
kAMDPackageMoveFailedError = "Das App-Paket konnte nicht an den Staging-Ort bewegt werden.";
kAMDPathConversionFailedError = "Der Pfad konnte nicht konvertiert werden.";
kAMDRestoreContainerFailedError = "Der App-Container konnte nicht wiederhergestellt werden.";
kAMDSeatbeltProfileRemovalFailedError = "Das Seatbelt-Profil der App wurde nicht entfernt.";
kAMDStageCreationFailedError = "Das Staging-Verzeichnis konnte nicht erstellt werden.";
kAMDSymlinkFailedError = "Der Symlink konnte nicht erstellt werden.";
kAMDiTunesArtworkCaptureFailedError = "Das iTunes-Cover konnte nicht gesichert werden.";
kAMDiTunesMetadataCaptureFailedError = "Die iTunes-Metadaten konnten nicht gesichert werden.";
kAMDAlreadyArchivedError = "Diese App ist bereits archiviert.";
kAMDUnknownCommandError = "Das Gerät hat den Befehl nicht verstanden.";
kAMDAPIInternalError = "Es ist ein interner API-Fehler aufgetreten.";
kAMDMuxCreateListenerError = "Es wurden keine USB-Geräte erkannt.";
kAMDMuxGetListenerError = "USB-Listener war nicht verfügbar.";
kAMDMuxConnectError = "Verbindung zum Gerät konnte nicht hergestellt werden.";
kAMDDeviceTooNewError = "Die App muss aktualisiert werden.";
kAMDDeviceRefNoGood = "Das Gerät ist nicht mehr verbunden.";
kAMDDeviceDisconnectedError = "Das Gerät ist nicht mehr verbunden.";
kAMDCannotTranslateError = "Eine Nachricht vom Gerät konnte nicht übersetzt werden.";
kAMDMobileImageMounterMissingImageSignature = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterResponseCreationFailed = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterMissingImageType = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterMissingImagePath = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterImageMapLoadFailed = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterAlreadyMounted = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterImageMoveFailed = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterMountPathMissing = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterMountPathNotEmpty = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterImageMountFailed = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterDigestFailed = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterDigestCreationFailed = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterImageVerificationFailed = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterImageInfoCreationFailed = "Programmierung wurde nicht unterstützt.";
kAMDMobileImageMounterImageMapStoreFailed = "Programmierung wurde nicht unterstützt.";
kAMDDeviceOSVersionTooLow = "Die OS-Version des Geräts ist zu alt.";
kAMDNoWifiSyncSupportError = "Das Gerät unterstützt keine drahtlose Synchronisierung.";
kAMDDeviceFamilyNotSupported = "Dieses Programm unterstützt diesen Gerätetyp nicht.";
kAMDPackagePatchFailedError = "Das Reparatur-Update konnte nicht auf das Programm angewendet werden.";
kAMDIncorrectArchitectureError = "Dieses Programm unterstützt den CPU-Typ dieses Geräts.";
kAMDPluginCopyFailedError = "Das VPN-Plug-In konnte nicht in den App-Container kopiert werden.";
kAMDBreadcrumbFailedError = "Das Installation der Pfadnavigation (Breadcrumb) konnte nicht geschrieben werden.";
kAMDBreadcrumbUnlockError = "Das Installation der Pfadnavigation (Breadcrumb) konnte nicht aktualisiert werden.";
kAMDGeoJSONCaptureFailedError = "Die GeoJSON-Daten konnten nicht gesichert werden.";
kAMDNewsstandArtworkCaptureFailedError = "Das Zeitungskiosk-Bild konnte nicht gesichert werden.";
kAMDMissingCommandError = "Die Anfrage enthielt keinen Befehl.";
kAMDNotEntitledError = "Das anfragende Programm darf diese Anfrage nicht vornehmen.";
kAMDMissingPackagePathError = "In der Anfrage fehlte der Paketpfad";
kAMDMissingContainerPathError = "In der Anfrage fehlte der Container-Pfad";
kAMDMissingApplicationIdentifierError = "In der Anfrage fehlte die Programm-ID.";
kAMDMissingAttributeValueError = "In der Anfrage fehlte ein erforderlicher Wert.";
kAMDLookupFailedError = "Die installierten Programme konnten nicht aufgelistet werden.";
kAMDDictCreationFailedError = "Die Eigenschaften aus dieser Anfrage konnten nicht extrahiert werden.";

/* kMISFileError */
"A file operation failed." = "Dateivorgang fehlgeschlagen.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "Eine signierte Ressource wurde hinzugefügt, geändert oder gelöscht.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Für diese ausführbare Datei wurde kein gültiges Bereitstellungsprofil gefunden.";

/* kMISUnknownError */
"An unknown error has occurred." = "Es ist ein unbekannter Fehler aufgetreten.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Versuch, ein unveränderliches Bereitstellungsprofil zu ändern.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "Die App hat keine gültige Signatur.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "Die Signatur der App ist gültig, entspricht aber nicht dem erwarteten Hash.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "Die ausführbare Datei enthält eine ungültige Signatur.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "Die ausführbare Datei wurde mit ungültigen Berechtigungen signiert.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "Die ausführbare Datei wurde von einer abgelaufenen Identität signiert.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "Die Signatur war ungültig.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Bei der Verbindung mit dem Gerät ist ein Fehler aufgetreten.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Das Bereitstellungsprofil kann auf diesem Gerät nicht installiert werden.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Das Bereitstellungsprofil enthält eine ungültige (bzw. eine gültige, aber nicht vertrauenswürdige) Signatur.";

/* kMISExpiredError */
"This provisioning profile has expired." = "Das Bereitstellungsprofil ist abgelaufen.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Das Bereitstellungsprofil ist fehlerhaft.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Das Bereitstellungsprofil wird nicht unterstützt.";

/* kMISAllocationError */
"Unable to allocate memory." = "Konnte keinen Speicher belegen.";

